# GetAvailableAttachedDetailGroupTypeIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupType..::..GetAvailableAttachedDetailGroupTypeIds Method
GroupType Class See Also
---
Returns the attached detail groups available for this element group type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.1
# Syntax
C#
---
```text
public ISet<ElementId> GetAvailableAttachedDetailGroupTypeIds()
```

Visual Basic
---
```text
Public Function GetAvailableAttachedDetailGroupTypeIds As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetAvailableAttachedDetailGroupTypeIds()
```

# ### Return Value
Returns the collection of attached detail group Ids that match this group's type.
# See Also
GroupType Class
Autodesk.Revit.DB Namespace